In [1]:
s={1,1,2}
s

{1, 2}

In [2]:
s=(1,2,3)
s

(1, 2, 3)

In [3]:
s=(1,2)

In [4]:
s

(1, 2)

TypeError: 'tuple' object does not support item assignment

In [6]:
s.type

AttributeError: 'tuple' object has no attribute 'type'

In [7]:
import numpy as np
import pandas as pd

In [8]:
arr={'b','a','c','a','b'}
data=[22,14,21]

In [9]:
pd.Series(data=data,index=arr)

c    22
a    14
b    21
dtype: int64

In [10]:
ser1=pd.Series([1,2,2,np.pi],["asd","I","x","X"])

In [11]:
ser1

asd    1.000000
I      2.000000
x      2.000000
X      3.141593
dtype: float64

In [12]:
ser1['asd']

1.0

In [13]:
arr=np.random.rand(1)
arr

array([0.56018235])

In [14]:
import pandas as pd
import numpy as np
from numpy.random import randn
df = pd.DataFrame(randn(5,4),index=['A','B','C','D','E'],columns=["W","X","Y","Z"])
df

          W         X         Y         Z
A -0.140673  0.537239 -1.249528 -0.277958
B  0.386458  0.037883  0.064970  1.352884
C -0.330120 -1.042019 -1.008432  0.296106
D -0.472094 -2.124144 -0.317950  0.992463
E -0.348008 -0.762653  0.031630 -0.260464

In [15]:
df>0

       W      X      Y      Z
A  False   True  False  False
B   True   True   True   True
C  False  False  False   True
D  False  False  False   True
E  False  False   True  False

In [16]:
df['W']>0

A    False
B     True
C    False
D    False
E    False
Name: W, dtype: bool

In [17]:
df[df['W']>0]

          W         X        Y         Z
B  0.386458  0.037883  0.06497  1.352884

In [18]:
(df['W']>0)&(df["X"]>0)

A    False
B     True
C    False
D    False
E    False
dtype: bool

In [19]:
df[(df['W']>0)&(df["X"]>0)]

          W         X        Y         Z
B  0.386458  0.037883  0.06497  1.352884

In [20]:
x=np.array[(df.loc['A']>0)|(df.loc['C']>0)]

TypeError: 'builtin_function_or_method' object is not subscriptable

In [73]:
(df.loc['A']>0)|(df.loc['C']>0)

KeyError: 'A'

In [22]:
df.loc[[df.loc['A']>0]]

KeyError: "None of [Index([(False, True, False, False)], dtype='object')] are in the [index]"

In [23]:
df[(df['W']>0)&(df['X']>0)]

          W         X        Y         Z
B  0.386458  0.037883  0.06497  1.352884

In [24]:
df.W

A   -0.140673
B    0.386458
C   -0.330120
D   -0.472094
E   -0.348008
Name: W, dtype: float64

In [25]:
df

          W         X         Y         Z
A -0.140673  0.537239 -1.249528 -0.277958
B  0.386458  0.037883  0.064970  1.352884
C -0.330120 -1.042019 -1.008432  0.296106
D -0.472094 -2.124144 -0.317950  0.992463
E -0.348008 -0.762653  0.031630 -0.260464

In [26]:
newOnes=[12,21,23,213,42]
df['newOnes']=newOnes
df.set_index('newOnes',inplace=True)

In [27]:
df

                W         X         Y         Z
newOnes
12      -0.140673  0.537239 -1.249528 -0.277958
21       0.386458  0.037883  0.064970  1.352884
23      -0.330120 -1.042019 -1.008432  0.296106
213     -0.472094 -2.124144 -0.317950  0.992463
42      -0.348008 -0.762653  0.031630 -0.260464

In [28]:
outerOnes=['F1','F1','F1','F2','F2']
index=list(zip(outerOnes,newOnes))
index=pd.MultiIndex.from_tuples(index)
df=pd.DataFrame(randn(5,4),index=index,columns=["W","X","Y","Z"])
df

               W         X         Y         Z
F1 12   0.193417  0.241297  1.319924 -0.604603
   21  -0.636689  0.267056  2.335219  0.619057
   23  -0.609774  0.716834  0.274056 -2.004473
F2 213 -0.213109  0.066629  0.953939 -1.006508
   42   0.836402  0.927941 -1.057816  0.532228

In [29]:
df.index.names=['fire','ice']
df

                 W         X         Y         Z
fire ice
F1   12   0.193417  0.241297  1.319924 -0.604603
     21  -0.636689  0.267056  2.335219  0.619057
     23  -0.609774  0.716834  0.274056 -2.004473
F2   213 -0.213109  0.066629  0.953939 -1.006508
     42   0.836402  0.927941 -1.057816  0.532228

In [30]:
print(df)

                 W         X         Y         Z
fire ice
F1   12   0.193417  0.241297  1.319924 -0.604603
     21  -0.636689  0.267056  2.335219  0.619057
     23  -0.609774  0.716834  0.274056 -2.004473
F2   213 -0.213109  0.066629  0.953939 -1.006508
     42   0.836402  0.927941 -1.057816  0.532228

In [31]:
df.loc['F1'].loc[12]

W    0.193417
X    0.241297
Y    1.319924
Z   -0.604603
Name: 12, dtype: float64

In [32]:
class Person:
    def __init__(self,fname,lname):
        self.firstname=fname
        self.lastname=lname
    def printname(self):
        print(self.firstname, self.lastname)
if __name__=="__main__":
    x=Person("John","Jane")
    x.printname()

John Jane

In [33]:
df1 = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [34]:
df1

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [35]:
df1.dropna()

     A    B  C
0  1.0  5.0  1

In [36]:
df1.dropna(axis=1)

   C
0  1
1  2
2  3

In [37]:
df1.fillna(value="Fill B")

        A       B  C
0     1.0     5.0  1
1     2.0  Fill B  2
2  Fill B  Fill B  3

In [38]:
df1.fillna(value=df1['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

In [39]:
df1.dropna(thresh=3,axis=1)

   C
0  1
1  2
2  3

In [75]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df3=pd.DataFrame(data)
df3

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [42]:
x=df3.groupby('Company')
x

In [43]:
x.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [45]:
x.median()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [46]:
x.mode()

AttributeError: 'DataFrameGroupBy' object has no attribute 'mode'

In [79]:
df3[df3['Sales']>128]

  Company Person  Sales
0    GOOG    Sam    200
2    MSFT    Amy    340
4      FB   Carl    243
5      FB  Sarah    350

In [47]:
df3.std()

/var/folders/ch/smc0q7m106q8yldyl_4tsr3w0000gn/T/ipykernel_8809/3573745355.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df3.std()

Sales    100.899455
dtype: float64

In [49]:
df3[Sales].std()

NameError: name 'Sales' is not defined

In [51]:
df3['Sales'].std()

100.89945490437498

In [52]:
x.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [55]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']})
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']}) 
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']})

In [56]:
pd.concat([df1,df2,df3])

     A    B    C    D
0   A0   B0   C0   D0
1   A1   B1   C1   D1
2   A2   B2   C2   D2
3   A3   B3   C3   D3
0   A4   B4   C4   D4
1   A5   B5   C5   D5
2   A6   B6   C6   D6
3   A7   B7   C7   D7
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [60]:
x=pd.concat([df1,df2,df3],axis=1).transpose()
x

    0   1    2    3
A  A0  A1   A2   A3
B  B0  B1   B2   B3
C  C0  C1   C2   C3
D  D0  D1   D2   D3
A  A4  A5   A6   A7
B  B4  B5   B6   B7
C  C4  C5   C6   C7
D  D4  D5   D6   D7
A  A8  A9  A10  A11
B  B8  B9  B10  B11
C  C8  C9  C10  C11
D  D8  D9  D10  D11

In [61]:
x[0]

A    A0
B    B0
C    C0
D    D0
A    A4
B    B4
C    C4
D    D4
A    A8
B    B8
C    C8
D    D8
Name: 0, dtype: object

In [62]:
x[A]

NameError: name 'A' is not defined

In [63]:
x.loc[A]

NameError: name 'A' is not defined

In [64]:
x.loc['A']

    0   1    2    3
A  A0  A1   A2   A3
A  A4  A5   A6   A7
A  A8  A9  A10  A11

In [80]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [81]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [69]:
left.head(2)

    A   B
0  A0  B0
1  A1  B1

In [70]:
left.head()

    A   B
0  A0  B0
1  A1  B1
2  A2  B2

In [82]:
left.index

Index(['K0', 'K1', 'K2'], dtype='object')

In [83]:
left.join(right,how="outer")

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [87]:
df = pd.read_csv('/Users/nikhileswar/Downloads/Refactored_Py_DS_ML_Bootcamp-master/03-Python-for-Data-Analysis-Pandas/example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [88]:
df.to_csv('/Users/nikhileswar/Downloads/Refactored_Py_DS_ML_Bootcamp-master/03-Python-for-Data-Analysis-Pandas/example',index=False)